[
  {
    "name":"X-Wing",
    "type":"Starfighter",
    "manufacturer":"Incom Corporation",
    "side":"The Force",
    "alliance":"Rebel Alliance\nRebel Pilot",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 12.5m\nWidth:   11.4m\nHeight:  2.3m",
    "armament":"4 Laser Cannons Taim & Bak KX9\n2 Torpedo Launchers Krupx MG7",
    "crew":"1 Pilot\n1 Astromech Droid",
    "hyperdrive":"Class 1,0 Incom GBk-585 hyperdrive unit",
    "passengers":"None",
    "maxspeed":"100 MGLT in Space, 1 050 km/h in the Atmosphere",
    "shortDescr":"The X-wing is a versatile Rebel Alliance starfighter that balances speed with firepower. Armed with four laser cannons and two proton torpedo launchers, the X-wing can take on anything the Empire throws at it. Nimble engines give the X-wing an edge during dogfights, and it can make long-range jumps with its hyperdrive and its astromech droid co-pilot. Luke Skywalker is famous for destroying the Death Star behind the controls of an X-wing.",
    "longDescr":"The X-wing was originally designed by Incom Corporation for the Empire, but the entire team of engineers joined the Rebel Alliance bringing with them all the prototypes. It is directly descended from the old Z-95 Headhunter and share design features with the ARC-170 fighter from the time of the Clone Wars, both designed by Incom and Subpro.\n\nThe X-wing has had several versions, continually improved. T-65AC1 original commissioned by the Rebel Alliance, is a correct versatile attack aircraft for its time, but soon supplanted by the T-65AC2, boasting improved acceleration. T-65AC3 improves board electronics, shields and sensors. T-65AC4 is primarily an upgrade engines, making it a craft almost equal to the A-wing in terms of maneuverability. A new design will be noted for the T-65D-A1, which replaces astromecanicians droids by an internal computer to jump into hyperspace calculations, but it is considered a failure, partly due to sabotage ease.\n\nShortly before the invasion of the Yuuzhan Vong, the New Republic comes the \"XJ\" series of X-wing model. A third compartment torpedo is added where is previously held a cargo compartment; which increases the payload of proton torpedo nine. Motors, lasers and electronics are also improved. The XJ can also use the new model droid astromécanicien R7, although some changes must be made to both the hunter and the droid. The \"XJ\" has been significantly improved in all respects from earlier designs and was originally dedicated to starfighter squadrons with Jedi pilots. The final model of the XJ series during the war is XJ3.\n\nIt was anticipated that the series of X-wing would be replaced by the Dark Empire model about six years after the Battle of Endor, but design issues concerning weapons placement delayed the introduction of the total in Dark Empire the NRDF (New Republic defense Fleet: the defending fleet of New Republic). The deployment of the Dark Empire style took place, especially in the fifth fleet, but the production of the X-wing nevertheless continued and equipped fighter squadrons not \"at the tip of the spear.\" A notable exception is Rogue Squadron, the best elite fighter squadron of the New Republic, and well known for its almost exclusive use of the X-wing.\nThere are two contradictory identification systems for X-wing. The basic designation \"T-65\" is constant, but the modifier is variable. At least two systems have been used. One of them uses the suffix \"AC1\" with the last number incremented when the vessel is maintained. A second system resembles that of modern military of the United States in which a letter is attached to the end in increasing value (T-65B, T-65D, T-65J, etc.). They are usually considered as different names for the same variations.\nThe T-65 is quite maneuverable and has four laser cannons associated with tubes for proton torpedoes. We can equip heavy missiles, but this requires considerable time and effort on the part of the technical teams. The versatility of the torpedo is ideal for different mission profiles of the X-wing. Lasers have several settings:\n\n<ul><li>Single shot, with each laser shot individually;</li><li>Double shooting in which two lasers, one on each side, fired alternately in pairs (up or down) </li><li>Firing quadruple, where all lasers (one at each end of the fins) pull simultaneously with a firing converge on the target.</li><li>Shoots burst, where many low-power beams are emitted. This change was incorporated during the invasion of the Yuuzhan Vong, to overwhelm their defenses solo. Probably also useful for anti-personnel purposes.</li></ul>\n\nThe hunter has a cockpit for a pilot and a passenger for external astromech droid, mostly an R2 unit. The astromech monitors the condition of the vessel can perform emergency repairs and record the coordinates for the hyperspace. R7, much more advanced than the R2 and present on the Dark Empire must be modified for use on an X-wing.",
    "img":"holo_1",
    "visual": "visual_1"
  },
  {
    "name":"Millenium Falcon",
    "type":"Light freighter",
    "manufacturer":"Corellian Technology Corporation",
    "side":"The Force",
    "alliance":"Rebel Alliance",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 34.37m\nWidth: 25.61m\nHeight: 8.27m",
    "armament":"2 Turrets Quad-Laser '\n2 Launches Missiles Arakid '",
    "crew":"1 Pilot, 1 Copilot\n2 Gunners",
    "hyperdrive":"Class 0,5 Avatar-10 hyperdrive (backup: x10)",
    "passengers":"6",
    "maxspeed":"75 MGLT in space, 1050 km/h in atmosphere",
    "shortDescr":"A legendary starship despite its humble origins and deceptively shabby exterior, the Millennium Falcon has played a role in some of the Rebel Alliance's greatest victories over the Empire. On the surface, the Falcon looks like a worn down junker. Beneath its hull, however, she packs many powerful secrets. Its owners have made \"special modifications\" on the freighter throughout the years, boosting its speed, shielding and performance to impressive -- and downright illegal -- levels. The Falcon pays a heavy price for these tricks and add-ons. It can be unpredictable, and its reconditioned hyperdrive often fails. Its current captain, Han Solo, has even been seen to restart a failed start-up with a hard knock on a bulkhead with his fist.",
    "longDescr":"The Millennium Falcon became after his involvement in the victories of the Rebel Alliance Death Star I and II, the most famous of the galaxy.\nDespite its outward appearance, the Millennium Falcon is no longer the standard of Corellian YT-1300 freighter. Heavily modified from its original configuration, the Millennium Falcon has acquired exceptional abilities, either speed or firepower. But propulsion, the various networks of information and firing capabilities of the Millennium Falcon require considerable maintenance. Each period of maintenance and repair is equivalent to about twice the time that has passed Falcon in flight.</p> <p>Speed is the essence of the vessels smugglers because they have to travel to remote separating the important cargo to supply as quickly as possible. The Millennium Falcon has an incredible combination of logical system droid and spatial navigation computer.\nIts weapons, designed for extended use without overheating can be used from the corresponding fire stations or from the cockpit. However, remote-controlled from the co-pilot position, they are generally less accurate to shoot the targets than used manually. In addition, the Falcon has a small retractable blaster cannon, of lesser scope and power, hidden under his belly. This can be used only when the Millennium Falcon has gone it must be absolutely controlled from the cockpit. </p> <p>Morover, a missile launches Arakyd is installed between the mandibles of the Millennium Falcon, and to be able to shoot very accurately from the cockpit, the launcher is positioned at the center of this space. His concussion missiles are powerful enough to penetrate the hulls of vessels despite a slight shield as they give off as much power as proton torpedo or lasers. With only two missiles that destroyed the Millennium Falcon reactor of the second Death Star.\nIt’s also is equipped with a system of deflector shields, who are totally incomparable with operating units in the imperial forces. Falcon twin two generators / projectors shields that are housed in front of the main hull, protected by the mandibles. The generators can be combined during enemy attack, all the accumulated power is available to strengthen the front bumper in a frontal and rear attack during a strategic retreat. Moreover, a navigation deflector is mounted between the two generators, above Arakyd launcher. It can detect the presence of micrometeorites and avoid catastrophic impacts.\nOne of the most characteristic features of the Millennium Falcon is its directional radar. Compared to the size of the vessel, this enormous radome provides a better detection at very long distance.\nLike all models YT-1300, the Falcon has three shims are usually loaded directly on both hatches space. The largest is located at the front of the vessel and it is often used for passenger transport. It can only be accessed by boarding hatch. On Falcon, this wedge is provided with a seat and a holographic game. The other two blocks are on the port and starboard sides.\nIn a smaller capacity, Solo transformed the bunker port in living space for the crew since it is equipped with a kitchen, a pantry and equipment necessary for the cleanliness of the owners (showers and toilets). This hold even a corridor to the hospital that also serves chamber. The starboard tank is the only one left in its original state.</p>",
    "img":"holo_2",
    "visual": "visual_2"
  },
  {
    "name":"Imperial Star Destroyer",
    "type":"Star Destroyer",
    "manufacturer":"Kuat Shipyards",
    "side":"The Dark Side",
    "alliance":"Galactic Empire",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 1,600m\nWidth:   1,015m",
    "armament":"6 Heavy Turbolasers\n2 Guns Heavy Ions\n60 Taim & Bak Turbolasers XX-9\n60 Ion Cannons Borstel NK-7\n10 Phylon Q7 Tractor Beam",
    "crew":"9,235 Officers\n9,700 Infantry\n27,850 Endlisted\n275 Gunners\n",
    "hyperdrive":"Class 2,0 (X8 backup)",
    "passengers":"9700 stormtroopers\n\n20 AT-AT (All Terrain Armored Transport)\n30 AT-ST (All Terrain Scout Transport)\n6 squadrons of TIE-fighters (20 fighters)\n15  DX-9 transport\n5 Assault Destroyers\n8 Lambda shuttles\n12 barges\n15 Sentinel shuttle\n",
    "maxspeed":"60 MGLT in space, 975 km/h in atmosphere",
    "shortDescr":"The wedge-shaped Imperial Star Destroyer is a capital ship bristling with weapons emplacements. Turbolasers and tractor beam projectors dot its surface. Its belly hangar bay can launch TIE fighters, boarding craft, land assault units, hyperspace probes, or be used to hold captured craft. Its bustling bridge is staffed by the finest crewers in the Imperial starfleet. The Star Destroyer is recognized as the signature vessel of the Imperial fleet. Its presence in a system marks matters of extreme Imperial import. Though, as is typical of the Empire, not even the Star Destroyer was enough to sate the Imperial hunger for displays of power. Larger vessels, such as the Super Star Destroyer, dwarf even these giants.",
    "longDescr":"An Imperial Star Destroyer first appears in the opening scene of A New Hope, chasing a Rebel ship (the Tantive IV). This appearance shows the Imperial ship's massive size in comparison to the Tantive IV.\nImperial-class Star Destroyers are constructed by Kuat Drive Yards and hold a distinguished place in the Imperial Navy, symbolizing the Empire's military might with a peak number of more than 25,000 vessels, though thousands were lost/destroyed to warlordism following Palpatine's death. The Imperial-class Star Destroyer is also informally referred to as an Imperial cruiser. Like the Victory- and Venator-class ships that precede it, the Imperial Star Destroyer is most notable for its massive size and overwhelming firepower; a single Imperial-class ship is capable of overwhelming most starships or devastating a hostile planet, and its mere presence is often enough to deter rebellion. At 1,600 meters (5,200 ft) long, Imperial-class Star Destroyers are armed with turbolasers, ion cannons and tractor beam projectors. They carry 72TIE fighters, numerous ground forces (including stormtroopers, 20 AT-ATs and 30 AT-STs), a prefabricated base for rapid deployment to planetary surfaces and a variety of support and landing craft.\nIn the Expanded Universe, after the climactic Battle of Endor, the Rebel Alliance captured several Imperial-class ships and added them to their own fleet. As the Rebel Alliance transitioned into the New Republic and gradually took large portions of the galaxy from the remnants of the Empire, it was able to procure more of the powerful ships as well as the vital shipyards and facilities with which to operate them.[5] Although the New Republic eventually upgrades its starfleet with newer ship types, theImperial-class Star Destroyer remains in service well into the New Jedi Order era and fights during the Yuuzhan Vong war.</p>",
    "img":"holo_3",
    "visual": "visual_3"  
  },
  {
    "name":"TIE Fighter ",
    "type":"Starfighter",
    "manufacturer":"Sienar Fleet Systems",
    "side":"The Dark Side",
    "alliance":"Galactic Empire",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length 6.3m",
    "armament":"2 Laser Cannons SFS LS-1",
    "crew":"1 Pilot",
    "hyperdrive":"Double Ion Engine Propulsion",
    "passengers":"None",
    "maxspeed":"100 MGLT in space, 1,200 km/h in atmosphere",
    "shortDescr":"The TIE fighter is the unforgettable symbol of the Imperial fleet. Carried aboard Star Destroyers and battle stations, TIE fighters are single-pilot vehicles designed for fast-paced dogfights with Rebel X-wings and other starfighters. The iconic TIE fighter led to other models in the TIE family including the dagger-shaped TIE Interceptor and the explosive-laden TIE bomber. The terrifying roar of a TIE's engines strikes fear into the hearts of all enemies of the Empire.",
    "longDescr":"Mass produced, the TIE / ln is the base of the Empire hunter. Built to be the most agile fighter and fastest of his time, he has neither shield nor life support systems or hyperdrive, and has a light armament. Despite these shortcomings, the TIE fighter responds to the threat of rebel fighter of the time, the Y-wing.\nBut the arrival of more advanced fighters such as the X-wing or A-wing, signs the death knell of this outdated fighter. To maintain control of the space, the Imperial pilots should then change their tactics and adapt them to battle against more powerful and stronger ships that the TIE / ln. Their only option will always fight in greater number in order to overwhelm the opponent under the number.\nThe TIE fighter is poorly armed, two laser guns only under the spherical cockpit. These lasers guns are produced by Sienar Wakeelmui in the system and are standard models, compatible with many TIE models to reduce production costs. Unfortunately, these models are less powerful than those of the X-wing, despite a higher rate of fire.\nTo counter the power of the rebel vessels, Imperial engineers developped later hunters with four laser cannons: TIE Interceptor, TIE Advanced and TIE Defender. Pending these models TIE, pilots TIE / ln, if they want to overcome the rebel fighters, often attack en masse.\nThe TIE Fighter, like most of the imperial models, do not have deflector shields, and is an easy prey for hunters of the Alliance, better armed and equipped with powerful shields. This is why the Imperial pilots most often operate in groups. The so-called tactics wolf pack allows TIE to offset their weaknesses, submerging their opponents under the number. At one against one, the TIE fighter may nevertheless prevail against some former fighters, including the Y-wing. But with a more recent hunter, chances are almost nil, and most of the imperial drivers do not survive their first missions.\nSpace superiority is the main mission for which the TIE is designed. This is clearly visible if you look closely at its features: its great agility, combined with its excellent speed, making it one of the best fighters of the beginning of the Galactic Civil War. Due to the overwhelming number of TIE fighters to commission in the Imperial fleet, yet some important aspects were sacrificed: shields, life support systems, hyperdrive, heavy weapons, etc. All these deficiencies are making the TIE an excellent hunter in its design, but will be soon overtaken by the hunters of the Alliance, X-wing head, forcing engineers Sienar design more efficient models.\nAt the Battle of Yavin, the TIE Fighters are the primary defense of the Death Star. The imperial resort has no fewer than 3,000 of these vessels on board. At that time, the TIE is the only imperial fighter able to compete with the vessels of the Alliance. The Empire, which underestimates the Rebels, and know that they have a plan to destroy the Death Star, finally send a handful of TIE fighters to face them. During this battle, it is the hunters of Black Squadron which illustrate the most. One of the hunters, Black 4, reaches even to touch Red 5, the hunter Luke Skywalker. Other hunters Black Squadron are also famous: Black Black 2 and 3 were indeed wingers Darth Vader during the battle.</p> <p>A few years after the Battle of Yavin, the TIE fighters still play a key role in protecting the second Death Star at the Battle of Endor (although several of TIE Interceptors squads are already operational, the TIE represents 80% of onboard fleet), including those of the Scythe squadron (Sickle). Scythe Squadron pilots have trained throughout the construction phase of the battle station, and have more of modified vessels, further increasing their maneuvering capabilities. During the Battle of Endor, they are the last bulwark against the rebel fighters led by the Millennium Falcon, Transport Corellian YT-1300 led by General Calrissian. But even with modified hunters, Imperial pilots fail to repel the assault, and the Second Imperial station suffered the same fate as the first.\nDuring the years following the defeat of the Empire, the TIE is gradually losing his place to his successor, the Interceptor. But it never really disappear: the impressive number of TIE manufacturing plants, pilots habits but also the financial problems of the post-Palpatine time oblige the Empire for a long time to maintain this model in its fighter squadrons.</p>",
    "img":"holo_4",
    "visual": "visual_4"
  },
  {
    "name":"LAAT",
    "type":"Gunship",
    "manufacturer":"Heavy Engineering Rothana",
    "side":"The Force",
    "alliance":"Galactic Republic",
    "movie":"Star Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revenge of the Sith",
    "size":"Length: 17.4 m\nWidth: 17m\nheight: 6,1m",
    "armament":"3 Antipersonnel Guns \n2 Missile Launchers\n4 Laser Cannons\n8 Air-to-Air Rockets",
    "crew":"1 Pilot\n1 Copilot\n2 Gunners",
    "hyperdrive":"",
    "passengers":"4 Moto-Jets\n30 Soldiers Clones\n1 IM-6 Medical Droid",
    "maxspeed":"50 MGLT in space, 620 km/h in atmosphere",
    "shortDescr":"Rugged, combat-equipped repulsorcraft, Republic attack gunships rained down blistering barrages of laser and rocket retribution against the droid forces of the Separatists. Each winged gunship was covered in weapons, offering air-to-ground and air-to-air support as well as serving as an infantry transport. The front of the gunship features hunchback-style cockpit bubbles, wherein the gunship pilot and copilot / gunner sit in single file. Chin-mounted on the craft are a pair of laser cannon turrets. On the gunship's dorsal surface are its primary armaments, two massive rocket launchers fed by a rear-mounted missile belts.",
    "longDescr":"The LAAT series gunships were designed to transport up to 30 clone troopers into combat and support them. It also had a rear hangar that could hold up to 4 speeder bikes to support reconnaissance operations or search and rescue missions. Early LAAT were in-atmosphere-only vehicles, requiring cruisers to land somewhere on the planet in order to launch. Although, with their range, it was common practice for cruisers to dip into the atmosphere, let the LAAT fly to the target zone, and be gone before combat even started. Later versions allowed it to fly through space and actually be used for boarding in ship-to-ship battles. Some versions of the gunship included Bacta tanks for medical transportation. Also sometime after the battle on Geonosis, an Alpha-Class Arc Trooper/Special Ops gunship was introduced with a new paint style, increased maneuverability and more flight time.</p>",
    "img":"holo_5",
    "visual": "visual_5"
  },
  {
    "name":"Naboo N-1 Starfighter",
    "type":"Luxury Starfighter",
    "manufacturer":"Engineers Starfleet Theed Palace",
    "side":"The Force",
    "alliance":"Naboo Royal Guards\nGalactic Republic",
    "movie":"Star Wars: Episode I The Phantom Menace\n\n",
    "size":"Length: 11m",
    "armament":"2 laser guns\n2 proto torpedo launchers (with 5 torpedoes)",
    "crew":"1 Pilot\n1 astromech droid",
    "hyperdrive":"Class 1,0 Nubia Monarc C-4",
    "passengers":"None",
    "maxspeed":"75 MGLT in space, 1,100 km/h in atmosphere",
    "shortDescr":"Protecting the skies and space around Naboo is the N-1 starfighter. Its sleek design exemplifies the philosophy of art and function witnessed throughout Naboo technology. Its twin radial J-type engines are capped in gleaming chrome and trail long delicate-looking finials behind the ship's single-pilot compartment. Behind the pilot sits a standard astromech droid, plugged into an abbreviated, ventrally-fed socket which requires the droid to compress slightly in order to fit within the vessel's curves. The fighter features twin blaster cannons, twin fire-linked torpedo launchers, and a capable automatic pilot feature.",
    "longDescr":"His long perfect curves, her royal chrome on the front of the device, the Naboo N-1 fighter belongs to the squadron of the Royal Naboo Security Forces. Despite the peaceful nature of Naboo, the Security Forces of the palace of Theed admire the need to have a space fighter squadron. There was already Gian speeders and Flash for land defense, and Naboo fighter full planetary defenses. The N-1 fighter designed and built by the engineers of the Space Fleet Theed Palace.</p> <p>With a length of eleven meters, the Naboo fighter has an advanced combat equipment. This equipment is elegantly concealed beneath the perfect curves of the hunter. It is, moreover, chrome all over the front to mark its membership of the Royal House of Naboo. The chrome is now purely decorative, it was once used to protect the driver of radiation high atmospheric layers of Naboo. But the pilot is now protected by electromagnetic fields and only the royal ships may display this finish applied by hand. It is very important during the celebrations and parades organized by the planet.</p> <p>The internal circuitry of the N-1 once again reflect the aesthetics of thought Naboo, they are arranged in straight lines, in intricate patterns in order not to appear disordered. To move in real space, the Naboo fighter wins two sublight engines modified Nubian 221. These Nubian engines, like all sophisticated devices in the world, allow the hunter to reach a speed of 1,100 km/h. A change was made to them to ensure that they pollute the atmosphere of the planet. Thereby they heat more than the usual motors. The long \"rat tails\" that extend the engines are part of the customization propulsion engineers Theed Palace, used as wicks heat to cool the modified engines. His hyperdrive is a model Nubian Monarch C-4 class 1. It can protect royal vessels that have a hyperdrive often similar.</p> <p>Two twin laser cannons provide the firepower of the ship. It carries over a shop that can hold ten proton torpedoes. Laser stabilization field generator follows the trench in which the spark passes and prevents it from becoming too unstable to the point of damaging the barrel. A powerful shot processor is located above the barrel to optimize the deadly accuracy of the hunter. A powerful shield protects the driver of medium power shots of other vessels but also oxidizing atmospheres which attack the ship's systems. Although a crash Naboo fighter is quite unlikely given the missions it fulfills the Theed Palace Engineers prefer to be too farsighted than not enough, so they endowed the hunter such shields as well as a complete equipment for survival in a hostile environment. \nThe \"rat tail\" behind the cockpit connects the device to the Palace of the systems. First, it serves to capture the high-voltage power delivered by the generator to activate Palace aircraft systems, transformers and converters included in the coating unit. Moreover, this central spike also receives coded information from the Palace of fighting computer. The data is downloaded to the hunter, which makes them safe from spying. The combat computer transfers critical data to each individual fighter, allowing the driver to concentrate on his job while the machine will spin automatically to its target. The astromech droid located in a compartment at the rear of the driver's seat allows the pilot not to manage the flight systems leaving the droid, which can also perform some repairs.\nAnother N-1 fighter is used for air missions, but this one is blue. Shields are much less powerful than his weapons but its maneuverability makes up for it undeniable. A squadron of these \"hunters Police\" was created and is called the Echo Squadron in opposition Bravo Squadron.\nHowever, the N-1 fighter is more suited to the space combat against hackers and minor targets against organized and equipped army ships more powerful than them. This is the power of the vessels which failed to be assured of lights and decisive victory against the ships of the Trade Federation. The pilots of Bravo Squadron believed their weapons, including their proton torpedoes, arrive at damage control droid ships, but they were wrong. It is only thanks to Anakin Skywalker Naboo that could claim to be winners. If he did not undergo a shot that had led inside the vessel, Bravo Squadron would actually destroy it.\nThe Naboo fighter is more a vessel intended for parades and battles against isolated and weak targets against huge over-equipped armies.</p>",
    "img":"holo_6",
    "visual": "visual_6"  
  },
  {
    "name":"Actis Eta-2 Jedi Interceptor",
    "type":"Starfighter",
    "manufacturer":"Kuat Systems Engineering",
    "side":"The Force",
    "alliance":"Galactic Republic",
    "movie":"Star Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revenge of the Sith",
    "size":"Length: 5.47 m\nWidth:   4.3m\nHeight:  2.5m",
    "armament":"2 Laser cannons\n2 Ion guns",
    "crew":"1 Pilot\n1 Astromech Droid",
    "hyperdrive":"Class 1,0 Syliure-45 hyperspace transport ring",
    "passengers":"None",
    "maxspeed":"125 MGLT in space, 1,500 km/h in atmosphere",
    "shortDescr":"Small wedge-shaped one-man starfighters, these vessels were used by the Jedi Order in the last days of the Galactic Republic. While the ship does employ weapons, most Jedi pilots preferred to rely on their cunning and connection to the Force to avoid disputes and aggression. With the outbreak of the Clone Wars, the Jedi saw themselves pressed into the forefront of military activity, serving as generals in the campaign against the Separatists. The demands of combat saw advancements in the Jedi starfighter arsenal, resulting in modifications and a new generation of fighter craft.",
    "longDescr":"At 5.47 meters in length, the Eta-2 was significantly shorter than the already diminutive Delta-7. The new fighter's mass was further reduced by removing much of the forward space-frame, leaving the front of the ship in a forked shape. Like its predecessor, it was also too small to hold an onboardhyperdrive. Because of this, the Eta-2 had to rely on carrier vessels orhyperspace transport rings for long-distance travel. However, the Actis did have a full astromech droid socket, instead of a truncated unit as was seen in the early models of Aethersprite starfighters.\nLike the simultaneously developed ARC-170 and Alpha-3 Nimbus-class V-wing starfighters, the Eta-2 incorporated S-foils to radiate excess engine heat in the thick of combat, reducing the likelihood of damage to the craft. Occasionally, though not always, the lifting panels were opened during normal flight to further reduce stress on the engines.\nSuch a design element carried with it certain flaws, however; this area of the hull was lightly armored, and extremely vulnerable to laser fire and buzz droid sabotage. \nThis design element would be carried on through the radiator panels of later TIE fighters which, unlike the Eta-2's foils, were locked in static positions but essentially served the same purpose.</p>",
    "img":"holo_7",
    "visual": "visual_7"  
  },
  {
    "name":"ARC-170 Starfighter",
    "type":"Starfighter",
    "manufacturer":"Incom Corporation, Subpro Corporation",
    "side":"The Force",
    "alliance":"Galactic Republic",
    "movie":"Star Wars: Episode III Revenge of the Sith",
    "size":"Length: 14,5m\nLength:  22,26m wingspan\nHeight:   4,78m",
    "armament":"2 Forward-Mounted Medium Laser Cannons\n2 Rear-Mounted Laser Cannons\n1 Proton Torpedo Launcher\n6 Torpedoes",
    "crew":"1 Pilot\n1 Co Pilot\n1 Gunner\n1 R4-series or R2-series Astromerch Droid",
    "hyperdrive":"Class 1,5",
    "passengers":"None",
    "maxspeed":"100 MGLT in space, 1,000 km/h in atmosphere",
    "shortDescr":"Protecting the skies over Republic worlds were specialized clone fighter forces flying the latest in starfighter technology. The ARC-170 fighter was a bulky, aggressive ship covered with weapons. Three clone trooper pilots operated this advanced combat craft, with a pilot handling the flight maneuvers, a copilot operating the laser cannons mounted on the ship's wide wings, and a tailgunner operating the dorsal rear-facing cannon. The fighter also carried an astromech droid for onboard repairs.",
    "longDescr":"The ARC-170 was jointly produced by Incom Corporation and Subpro. Like Their other starfighter designs, such the lighter Z-95, and the heavier PTB-625, the ARC-170 had a narrow spaceframe flanked by wide engines. The ARC-170 also possessed an S-foil system, which helped to radiate heat, something that aided the fighter's shielding. This also provided additional stability during atmospheric flight.</p> <p>Using the front deflector shield projectors to disperse heat generated from air resistance, the ARC-170 could reach supersonic speeds in atmospheric flight. </p> <p>It was designed to be built small, fast, and maneuverable, at the cost of heavy weapons, shields, and hyperdrives. On the other hand, the ARC-170 was wide rugged, and able of long independent operations.\nThe ARC-170 was often sent on scout dangerous assignments and raids deep in enemy territory. To allow the ARC-170 to perform thesis missions, the fighter was equipped with a class 1.5 hyperdrive, and Its nose Was filled with Powerful sensors , scanners, and jammers.\nThe ARC-170 of carried enough consumables for five days of operation. However, the additional supplies and equipment had a price and the ARC-170 was quite slow. Durable armor and shielding, as well as two tail guns, the ARC-170 helped to survive when surrounded by swarms of smaller, faster enemy fighters.</p> <p> The ARC-170 possessed Powerful weaponry. The carried six proton torpedoes, and its wingtip-mounted medium laser cannons were unusually wide for a starfighter. ARC-170s were often used as the heavy-hitters in strike forces escorted by V-wings and Eta-2s.\nThe ARC-170 Was crewed by three clones: a pilot, a gunner forward Who operated the wingtip-mounted lasers, and a tail gunner who operated the rear-mounted cannons. The fighter astromech droid year the carried aussi to perform onboard repairs and navigation. It was also possible for the pilot to operate the wingtip laser cannons if co-pilot was not available. \nDuring The Clone Wars, It Was common for elite pilots to customize their vessel vessels with elaborate designs, such as the elite Razor Squadron. \nOriginally Introduced and adopted by the Republic shortly before the Clone Wars, CRAs were fairly extensively used during the late Clone Wars.\nDuring The Battle of Malastare, a squadron of ARC fighters escorted a squadron of BTL-B Y-wings carrying the electro-proton bomb and cover Provided by strafing enemy Against AATs ground formations. They Were also used in the Defense of Kamino.Shortly Before the Battle of Coruscant, a squadron of ARCs Provided cover for Obi-Wan Kenobi and Anakin Skywalker on Tythe, aim were mostly destroyed.\nDuring The Battle of Coruscant, Clone Flight Squad Seven (operating with ARC-170s) covered for Kenobi and Skywalker as they made their way to the Invisible Hand. Although Squad Seven Suffered Many casualties, they allowed the two Jedi to successfully board the ship and rescue Supreme Chancellor Palpatine. Large numbers of ARC-170s were destroyed by droid tri-fighters in the battle.</p> <p>During The Galactic Civil War, ARC-170s could be found in both imperial and rebel fleets, where they were considered elite craft. As with all craft commissioned by the New Empire, ARC-170s were henceforth given the standard Imperial gray 'color scheme, doing away with the variety of colorful markings that military vessels boron to Identify their squadron affiliations with during the Clone Wars. \nOne old ARC-170 was found in an old secret hangar of the Rebel Alliance on the planet Dathomir. The Wookiees Imarrra and Orrekazzapirr took this ARC-170 after they had been freed from the Imperial Prison facility and managed to punch a hole through the Imperial blockade around the planet.\nQueen of Naboo Kylantha also owned several old ARC-170s. She Gave one to an adventurer as a token of appreciation for helping the Wookiees Imarrra and Orrekazzapirr escape from captivity. </p>",
    "img":"holo_8",
    "visual": "visual_8"
  },
  {
    "name":"Lambda Class Shuttle",
    "type":"Armed Governement Transport Shuttle",
    "manufacturer":"Incom Corporation, Subpro Corporation",
    "side":"The Dark Side",
    "alliance":"Galactic Republic",
    "movie":"Star Wars: Episode III Revenge of the Sith\nStar Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 20m",
    "armament":"3 Double Blaster Cannons\n2 Double Laser Cannons\nScrambling System\nAdvanced Tactical System",
    "crew":"4 Crewmen\n2 Officers",
    "hyperdrive":"Class 1,0 SFS S/ig-37 hyperdrave (x10 backup)",
    "passengers":"20 stromtroopers",
    "maxspeed":"50 MGLT in space, 850 km/h in atmosphere",
    "shortDescr":"An elegant example that stands apart from typical brutish Imperial engineering, the Lambda-class shuttle is a multi-purpose transport used in the Imperial starfleet. The Empire pressed the shuttle into service for both cargo ferrying and passenger duty. Even the Empire's elite, like Darth Vader and the Emperor Palpatine used these shuttles. It has three wings: a stationary center foil and two articulated flanking wings. When in flight, the side wings fold out for greater stabilization. When landing, the wings fold in, shrinking the vessel's silhouette.The well-armed vessel has two forward-facing double laser cannons, two wing-mounted double cannons, and a rear-facing double laser cannon. It is equipped with a hyperdrive.",
    "longDescr":"ST 321 was equipped with sensor jammers, specialized tactical displays, and other modified features, such as advanced targeting systems.The \"ST\" in the shuttle's designation stood for \"space transport.\" It is escorted by a contingent of TIE/LN starfighters, one of which includedBlack 11.\nVader's shuttle featured a meditation chamber aboard similar to the one on his flagship, the Star Dreadnought Executor.\nOne of ST 321's earliest uses was in 18 BBY, where it was returning Palpatine and Vader from Yinchorr. It was boarded by six Stormtroopers cloned from Sa Cuis's genetic template led by the treacherous Emperor's HandSheyvan, who intended to usurp Emperor Palpatine during his rule. Vader, alongside Lieutenant Erv Lekauf and cloned Stormtroopers derived from the latter's template, fought back, resulting in Vader killing Sheyvan in a quick duel. Lekauf, however, was severely burned from the fires aboard the vessel.\nThroughout the Imperial Period and the Galactic Civil War, Vader utilized the shuttle for instances that required him to make a personal appearance to motivate the Imperial forces. In 1 ABY, Vader—accompanied by a unit of Triumphant-class dark troopers—used this shuttle during the operations Molecular Clamp, Sieve, Green Lightand Take Down to travel to the cities of Bestine, Coronet and Theed, respectively. In addition, he also used the shuttle to travel directly to Theed during Empire Day Festivities to personally present several dedicated Imperial officers with awards for acts of service and loyalty to the Empire. A year later, Vader later used the shuttle to travel to Bespin during its occupation by Imperial Forces to coerce its administrator, Lando Calrissian, who was also a former acquaintance of Han Solo, into delivering him, Leia, and Chewbacca to him. After losing Luke Skywalker during their duel, he used the shuttle to return to the Executor.\n Shortly before the Battle of Endor, the ST 321 brought Darth Vader from the Star Destroyer Avenger to the second Death Star. This was the shuttle Luke Skywalker used to escape the second Death Star along with his deceased father. He managed to get to the shuttle relatively easily as the Imperials were in the middle of an evacuation at the time.</p>",
    "img":"holo_9",
    "visual": "visual_9"
   },
  {
    "name":"Republic Attack Cruiser ",
    "type":"Star destroyer",
    "manufacturer":"Kuat Systems Engineering",
    "side":"The Force",
    "alliance":"Galactic Republic",
    "movie":"Star Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revenge of the Sith",
    "size":"Length: 1,137m\nWidth:   548m\nheight:  268m",
    "armament":"8 DBY-827 Heavy Dual Turbolaser Turrets\n2 Medium Dual Turbolaser Cannons\n52 Defense-point Laser Cannons\n6 Tractor Beam Projectors\n4 Heavy Proton Torpedo Tubes\n16 Torpedoes Each",
    "crew":"7,400 Men",
    "hyperdrive":"Class 1,0 (x15 backup)",
    "passengers":"1,700 Troops\n192 Alpha-3 Hunters\n192 Interceptor Eta-2 Actis\n36 ARC-170 Fighters\n80 LAAT\n24 AT-ST",
    "maxspeed":"50 MGLT in space, 975 km/h in atmosphere",
    "shortDescr":"The Republic attack cruiser was not primarily a cargo transport, troop carrier or other replenishment or supply vessel; it was developed and honed for ship-to-ship combat. Its huge armored shape had an aggressive, dagger-like profile, studded with heavy weapons emplacements capable of punching through powerful shields and sturdy armor. The front half of the ship's spine contained a massive flight deck capable of scrambling the latest in Republic starfighters. The huge hangar doors opened to allow ships to land or takeoff from the deck; the vessel also had a smaller docking bay entrance on its lower side.",
    "longDescr":"A stock ship was 1,137 meters long, making it one of the largest capital ships capable of atmospheric operations, landing on planets to load and unload troops and vehicles.\nThe Venator-class was born from the success of the Acclamator-class assault ship and was designed by Lira Blissex for the purpose of serving as a medium-sized, versatile multi-role warship.\nWhile designed primarily for ship-to-ship combat, the Venator had secondary roles ranging from starfighter carrier, to military transport and battleship escort. The expanded carrier role made the Venator-class popular amongst Jedi starfighter aces.\nAs a popular multi-role warship of the Republic Navy, the Venator was considered heavily armed and armored enough to lead assaults on Rim worlds like Utapau as well as fast enough to chase down blockade runners.Due to being relatively less self-sufficient than other ships in the fleet, the Venator-class often relied upon supply lines to aid long-range campaigns.\nThese vessels also sported the red color of diplomatic immunity all Republic ships sported; by the beginning of the Galactic Empire, the hulls were deprived of this symbol of the Republic, giving them a dull Imperial-gray appearance. The armament of a single Venator-class Star Destroyer consisted of eightDBY-827 heavy dual turbolaser turrets, two medium dual turbolasercannons, fifty-two point-defense dual laser cannons or turbolasers, and four heavy proton torpedo tubes.</p> <p> The Venator-class's eight heavy dual turbolaser turrets were its main weapons and had two tracking modes. In its precise, long-range tracking mode, the DBY-827 could hit a target vessel at a range of ten light minutes. During close-range fights, the turrets could rotate in three seconds with their fast-tracking mode. In terms of firepower, these weapons rivaled the main battery on the later Imperial I-class Star Destroyers.\nThe DBY-827 had seven different power settings. This allowed the Venator's pilots and gunners to select a range of destruction, from a small strike to a vaporizing blow. As a true warship, the Venator-class Star Destroyer could divert almost all of its reactor output to its heavy turbolasers when needed. As a result of this, a flotilla of Venators could break through the shields of a Trade Federation battleship with ease.\nAt the suggestion of Anakin Skywalker, a heavy SPHA turbolaser cannon was installed within the ventral hangarbay of some Venator-class ships of the Open Circle Fleet. These weapons were meant to protect the Star Destroyers while they opened their long ventral doors to the army complement bays. They would be used to considerable effect during the Battle of Coruscant.</p>",
    "img":"holo_10",
    "visual": "visual_10"
  },
  {
    "name":"A-Wing",
    "type":"Starfighter",
    "manufacturer":"Corporation Incom",
    "side":"The Force",
    "alliance":"Rebel Alliance",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 9,6m\nWidth:   6,48m\nheight:   3,11m ",
    "armament":"2 Borstel Rg-9 Laser Cannons\n2 Dymek HM-6 Missile Launchers\n6 Concussion Missiles Each (standard load)",
    "crew":"1 Pilot",
    "hyperdrive":"Class 1,0 (Incom GBk-785 hyperdrive)",
    "passengers":"None",
    "maxspeed":"120 MGLT in space, 1,300 km/h in atmosphere",
    "shortDescr":"With its sleek arrowhead shape, streamlined cockpit and massive twin engines, the A-wing starfighter suggests raw speed even when parked within Alliance hangar bays. Faster than even the TIE interceptor, the A-wing is well suited for lightning strikes. It sports a pair of pivoting laser cannons on each wingtip. The starfighters of Green Squadron, which flew in the Battle of Endor, were made up of A-wing starfighters.",
    "longDescr":"The RZ-1 A-wing interceptor was a cockpit attached to twin engines. Like its Clone Wars predecessor, the Eta-2, the A-wing required pilots of exceptional skill to take full advantage of the vessel's speed, agility, and special features—and the Rebel Alliance lacked the Galactic Republic'sJedi pilots.\nThe A-wing's Novaldex J-77 Event Horizon engines remained some of the most powerful sublight thrusters two decades past the A-wing's creation and were linked to highly sensitive controls. The vessels presented a number of challenges to pilots. Pilots had to adjust two dorsal and two ventral stabilizer wings with great care, as even a minor turn could send the speedy A-wing into a massive spinout.\nThe slight A-wing's wing-mounted laser cannons could rotate up and down sixty degrees for greater fire control. Some of those designs even had their guns modified to swivel in a complete 360-degree arc, thus providing a nasty surprise to any chasing fighter. While a tactical boon, the A-wing had no astromech droid to manage its weapons systems, requiring further attention from the pilot. In addition, they also had a high rate of mechanical failure, and contributed to the fighter's extremely costly maintenance-to-flight ratio. This, among other reasons, contributed to the difficulty of keeping a squadron of A-wings operational for any length of time.\nThe combination of sensitive controls, unmatched sublight thrust, maneuverable weapon systems, advanced sensory and stealth packages, fragility, and heavily exposed cockpit strained even the best pilot. A-wings earned the nickname \"slims\" for their small frame made of carbo-plas, but also for the \"slim\" chance of a pilot surviving a direct hit on the ship after the shields were down, and the cramped cockpit that prevented larger pilots from flying the A-wing.\nThe wedge-shaped craft had an access panel on the forward bow, and carried the its two Dymek HM-6 Concussion Missile Launchers along the sides. Each launcher was capable of launching 6 concussion missiles. Thrust control jets were at the rear of the craft, just behind the rear Sirplex Z-9 deflector shield projector. The engines, capable of propelling the starfighter to up to 1300 kilometers per hour and 120 MGLT, were placed in the aft of the craft had thrust vector controls. The A-wing carried a sensor jamming unit, including a FabritechANs-7e sensor unit with PA-94 long range phased tachyon detection array and PG-7u short range primary threat analysis grid, along with targeting systems in the form of a Fabritech ANq 3.6 tracking computer and an IN-344-B \"Sightline\" holographic imaging system The avionics was a Torplex Rq9.z flight control system. The craft carried one pilot and up to 40 kilograms of cargo.\nThe weapons carried on-board, including advanced concussion missiles, gave the craft the power to engage larger Imperial targets up to and including Imperial Star Destroyers.\nMany of the starfighters were produced in underground factories, and at least one at the Battle of Endor had fijisi wood panels. The A-wings were maintenance-heavy and prone to breakdowns, although the sensor jammers and concussion weapons were effective in lightning raids.\nAlthough a fighter in its own right, it also was especially notable for its intelligence-gathering and reconnaissance missions, in large part because of its hyperdrive capability, speed, and maneuverability. The ship was littered with concealed multi-spectral imagers and other sensors, which allowed the pilot to gather information about an enemy and then escape back into hyperspace before TIE fighters could be scrambled. These activities were further enhanced by its sensor-jamming system, which was powerful enough to disrupt detection and targeting systems of TIE fighters and other small vessels, although it is ineffective against capital ships, and acted as a double-edged sword due to the jamming system giving a precise lock on the fighter if detected by the enemy. As such, experienced pilots of A-wings were capable of dropping out of hyperspace close to an Imperial fleet or space-installation, make a blistering run through it, and then use its on-board imagers and sensors to gather information and hyperspace out before being detected and scrambling TIEs.\nThe A-wing's wedge-shaped prow was fitted with a reinforced heat shield. Although the shield was intended for atmospheric entry, the shield also acted as a makeshift battering ram at close ranges within atmospheric flight or space battles. This ramming process against enemy vessels was largely used by pilots during space battles as a last resort if left with no hope of escape or survival, with the pilots relying on the nose wedge to breach the ship's hull and thus either cripple the ship or otherwise destroy it. This tactic was famously demonstrated byArvel Crynyd during the Battle of Endor, where he rammed into the bridge of the Star Dreadnought Executor.\n",
    "img":"holo_11",
    "visual": "visual_11"
  },
  {
    "name":"Y-Wing",
    "type":"Assault Starfighter",
    "manufacturer":"Koensayr Manufacturing",
    "side":"The Force",
    "alliance":"Rebel Alliance",
    "movie":"Star Wars: Episode IV A New Hope\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 16m\nWidth:   7,9m\nheight:   2,9m ",
    "armament":"2 Taim & Bak IX4 or KX5 Laser Cannons\n2 Light ArMek Turrested SW-4 Ion Cannons\n2 Arakyd Flex Tube Proton Torpedo Launchers\nProto Bombs",
    "crew":"1 Pilot\n1 Co-pilot/gunner\n1 Astromec Droid",
    "hyperdrive":"Class 1,0 (Koensayr R3000-H Hyperdrive Motivator)",
    "passengers":"None",
    "maxspeed":"80 MGLT in space, 1,000 km/h in atmosphere",
    "shortDescr":"The Y-wing is a workhorse starfighter has been in use since the Clone Wars. Used for dogfights and for bombing runs against capital ships and ground targets, Y-wings are often overshadowed by newer models such as the X-wing and the A-wing. But the Y-wing's historical importance is remarkable, and it has reliably served multiple generations of star pilots.",
    "longDescr":"Affectionately known as a \"wishbone\" to Rebel Alliance and New Republicpilots, the Y-wing starfighter was deployed as a fighter-bomber, designed to fight its way to its objective, deliver its payload of high explosives, and fight its way out again. Its weaponry included two laser cannons, two ion cannons, and two proton torpedo launchers. An astromech droid, such as an R2 unit, could be plugged into a socket behind the cockpit to act as a co-pilot and manage the ship's various systems.\nThe Y-wing was a resilient, well-shielded craft, but was slow and ungainly compared to other Alliance fighters. Its deficiencies were partly compensated for by the heavy proton torpedo load it could carry, and its ability to paralyze craft with ion cannon fire without destroying them, a unique ability until the B-wing starfighter was introduced after the Battle of Yavin. In addition to the Rebel Alliance, many planetary defense forces, mercenaries, and pirates fielded the craft.\nIt was a rugged design, but it had some design flaws requiring constant maintenance, which led to many aggravated maintenance crews getting fed up with constantly having to remove the superficial hull plating and disposing of it altogether. Due to this, many Y-wings had no hull plating (except on the cockpit), exposing the internals of the main hull.\nIn at least one Y-wing, special features were included which assisted in the event of crashing on the surface of a planet. Inflatable balloons were deployed which kept the ship afloat in case of a water landing, and the cockpit could be ejected from the rest of the ship and driven as its own vehicle. It is unknown whether this was a standard feature or a customization.\nDespite its shortcomings in speed and maneuverability compared to space superiority fighters such as the X-wing (or especially compared to interceptors like the A-wing), the Y-wing was an extremely durable craft, with heavier armor and shielding making it a favorite among some Alliance pilots during the Galactic Civil War. The Y-wing also had a larger warhead magazine. The Y-wing was not a sluggish fighter overall, as its speed and agility exceeded that of its intended replacement, the B-wing.\nX-wing starfighters and A-wing interceptors were used to distract enemy fighters and the enemy ships' gunners to allow the Y-wings and B-wings to focus their fire on capital ships. This tactic was similar to the A-wing Slash, which involved solely X-wings and A-wings.\n",
    "img":"holo_12",
    "visual": "visual_12"
  },
  {
    "name":"Slave I",
    "type":"Space Transport",
    "manufacturer":"Kuat System Engineering",
    "side":"The Dark Side",
    "alliance":"Trade Federation\nGalactic Empire",
    "movie":"Star Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revenge of the Sith\nStar Wars: Episode V The Empire Strikes Back\nStar Wars: Episode VI Return of the Jedi",
    "size":"Length: 21,5m\nWidth:   21,3m\nheight:   7,8m ",
    "armament":"2 Twin Blaster Cannons \n2 Rapid-firing Laser Cannons\n2 Projectile Launchers (With 3 Torpedoes)\n1 Minelayer (With 9 Seismic Charges)",
    "crew":"1 Pilot\n1 Co-Pilot",
    "hyperdrive":"Class 1,0 (Backup Class 8,0)",
    "passengers":"6 prisoners\n2 passengers ",
    "maxspeed":"70 MGLT in space, 1,700 km/h in atmosphere",
    "shortDescr":"The deadly Slave I was infamous for its association with Jango Fett, a bounty hunter in Mandalorian armor. Fett packed the craft with weapons, from laser cannons and projectile launchers to seismic charges. After Jango's death, Boba Fett refitted Slave I and made it his own. A generation after his father's death, the distinctive craft remained the last thing fugitives wanted to see on their scanners.",
    "longDescr":"Originally, Slave I was a prototype police vehicle from the asteroid prison Oovo IV. There were only six of the model in the entire galaxy, all on Oovo IV. While on the trail for the Dark Jedi and Bando Gora leader, Komari Vosa, Jango Fett captured Bendix Fust for the crime lord Sebolto. Fett was beaten to Fust in Desolation Alley by another bounty hunter, who then began a prison riot. After fighting his way through armed guards and prisoners, Jango made it back to his ship, Jaster's Legacy. Unfortunately, the rival bounty hunter attempted to slice into the old ship. After helping Zam Wesell defeat a horde of guards, a Firespray-class starship fired upon Jango's ship, destroying it.\nActing on a tip from the elevator manager, Jango made his way into the asteroid prison's hangar bays and stole a Firespray-class vessel along with Wesell. During their escape, Jango launched two missiles into the hangar bay housing the other five Firespray vessels and destroyed them to deny any chance of being pursued, leaving his the only ship of its type in existence. Sometime later, Jango would name his new ship, Slave I. It was not until Kuat Systems Engineering reintroduced the Firespray line several decades later that other examples of the class would again be seen. Like all Firesprays, Slave I sat flat on its bottom surface when idle, although during flight the ship rotated 90 degrees to maneuver vertically. Boba later added a unique stabilization system which always kept the cockpit oriented \"up\". Slave I was a well-armed starship, and to keep it from becoming obsolete, it was endlessly modified. It was stolen during the Vosa bounty, near the time of the creation of the Grand Army of the Republic and the end of Jango's life. While under Jango Fett's ownership, its weaponry included two heavy twinblaster cannons, as well as two rapid firing laser cannons. Rounding out the ship's armament were two projectile launchers, each holding a magazine of three homing missiles or various other payloads, and a naval minelayer equipped with seismic charges.\nSlave I also possessed special dummy proton torpedoes mounted with homing beacons and S-thread trackers. By tagging a ship with one of these beacons, Fett could then utilize his contraband HoloNet transceiver to track ships through hyperspace. Most of these weapons were hidden beneath the hull; the armor plating would slide away during the ship's attacks. The ship was also outfitted with a sensor array that could detect minute changes in the ship's mass, which could be used to find homing beacons.\nJango added a spartan crew quarters since the original Firespray was suited for short-term patrols. On top of all this, Jango devoted two-thirds of the entire ship's interior to the powerful upgraded Kuat drive engines and power generators, giving Slave I the sublight speed of an Alliance BTL Y-wing starfighter — a remarkable feat for a ship of Slave I's size. There was a combination airlock and docking ring behind the cockpit, although this was covered by a sensor dish at various points in the vessel's history.\n",
    "img":"holo_13",
    "visual": "visual_13"
  },
  {
    "name":"Snowspeeder",
    "type":"Airspeeder/Repulsocraft",
    "manufacturer":"Incom Corporation",
    "side":"The Force",
    "alliance":"Rebel Alliance",
    "movie":"Star Wars: Episode V The Empire Strikes Back",
    "size":"Length: 4,5m",
    "armament":"Standard Version : \nHarpoon and Tow Cable\n\nModified Version : \n2 CEC AP/11 Double Laser Cannons\nRear Facing Weapon\nUbrikkian Mo/Dk Energy Harpoon Cable or Light Repeating Blaster Cannon",
    "crew":"Standard Version : \n1 Pilot\n1 Cargo Manager\n\nModified Version : \n1 Pilot\n1 Co-pilot",
    "hyperdrive":"None",
    "passengers":"None",
    "maxspeed":"1,100 km/h in atmosphere",
    "shortDescr":"When stationed on Hoth, the Rebel Alliance modified T-47 airspeeders to become snowspeeders, fast flying conveyances for patrol and defense of their hidden base. It took some doing to keep the crippling cold from permanently grounding their airforce, but Rebel ingenuity overcame the relentless Hoth elements. The T-47 airspeeder is a small, wedge-shaped craft with two forward-facing laser cannons. In its rear arc is a harpoon gun fitted with a heavy-duty tow cable. The snowspeeder is a two-man vessel, with a pilot and rear-facing tailgunner.",
    "longDescr":"The T-47 was modified by the Rebel Alliance technicians into a patrol and combat craft, becoming commonly known as the snowspeeder, especially after its extensive use at Echo Base on Hoth.\nThe Rebel Alliance had used the T-47 airspeeder for reconnaissance on Dantooine and other planets. When the Rebels moved to Hoth, the airspeeder required modifications to function for extended periods in the extremely cold climate. One of the technicians involved in the modifications was Deen Voorson. Heaters were added near the drive units, and de-icing nozzles were added to prevent icing on control surfaces. Rebel technicians also scavenged Y-wing parts, including armor plates, control surfaces, and refitted cockpit modules for the snowspeeder.\nThe Rebels armed the craft with dual AP/11 dual laser cannons and converted the cargo manager into a gunner. Computerized targeting systems and displays were used by the gunner to control the lasers and harpoon gun. However, the pilot could take control of weapons if needed. Since the speeder lacked shields, armor plating was added to the hull. An advanced power plant and repulsorlift engines were installed to compensate for the added weight of armor and weapons. Its small size, maneuverability and speed allowed the ship to dodge weapons fire.\nIn addition to cold environments, T-47s were modified by Alliance forces for use in several different climates. The swampspeeder version included flotation gear and water-tight seals. The sandspeeder was equipped with advanced filters to keep out sand, engine cooling units, and long-range radar for navigating sandstorms. The skyspeeder had a pressurized cockpit and more powerful repulsorlifts for higher altitudes, and was used in patrolling the Rebel's base on Arbra.\nT-47s were used by the Rebel Alliance in hit-and-run missions during theGalactic Civil War. The T-47 was also vital to Alliance tactics such asAttack Pattern Beta and Attack Pattern Delta.\nDuring the Battle of Hoth in 3 ABY, snowspeeders delayed the advancing Imperial forces, providing extra time to evacuate Rebels from Echo Base. After finding the snowspeeders' blasters to be ineffective against the armored AT-AT walkers, Rebel pilots used tow cables to tie up the legs of AT-ATs, causing at least one to crash to the ground. Regardless of this partial success, many—if not most—of the snowspeeders that participated in the battle were either damaged or destroyed. Those not lost in combat were demolished by the Rebels.\nFollowing the Battle of Hoth, the T-47 continued to be used by the Rebel Alliance and the harpoon-and-tow cable tactic was employed in other battles, including the Battle of Kothlis.\n",
    "img":"holo_14",
    "visual": "visual_14"
  },
  {
    "name":"C-9979 Landing Craft",
    "type":"Landing Craft",
    "manufacturer":"Haor Chall Engineering",
    "side":"The Dark Side",
    "alliance":"Trade Federation\nConfederacy of Independant Systems",
    "movie":"Star Wars: Episode I The Phantom Menace",
    "size":"Length: 210m\nWidth:   370m\nHeight:  150m",
    "armament":"4 Wingtip Laser Cannons\n2 Fire-linked Pairs\nFront Fire Arc\n4 Turret-Mounted Cannons\n2 Fire-links Pairs",
    "crew":"88 OOM-series Battle Droids or\n140 Sapients",
    "hyperdrive":"None",
    "passengers":"30 Repair Droids\n40 OOM Command Battle Droids\n39 OOM Pilot Battle Droids\n164 OOM Security Battle Droids",
    "maxspeed":"587 km/h in the atmosphere",
    "shortDescr":"The C-9979 landing craft, also known as the Trade Federation landing ship or the Separatist landing craft, was a large-sized landing craft built by Haor Chall Engineering for the Trade Federation's military forces, and later for the Confederacy of Independent Systems. When the Trade Federation began planning to create its military forces, Haor Chall Engineering produced a design for a landing craft that would carry troops and ground vehicles from warships down to planets.",
    "longDescr":"The C-9979 configuration was chosen due to its close resemblance to the commercial barges used by the Federation's merchant fleet. The ship had four wings with a wingspan of 370 meters. These wings were removable so that they could be stored away easily aboard the massive battleships. They were bound by powerful tensor fields to the fuselage when the craft was assembled for use. Even the strongest metal alloys were unable to bear the immense cargo weight inside the wings, thus making tensor fields essential for the craft.\nA series of maintenance and repair stores were located along the front of these wings and service the assault force components, particularly battle droids needing servicing after battles. Forward tensor fields connected the wing mounts firmly to the fuselage and wing-mounted tensor fields prevented the span of the wings from collapsing under pressure.\n\nThese wings were used to carry vehicles racked in garage channels for maximum loading capacity. Each carried 11 MTTs that carried troops on the frontlines, 28 PAC for deploying troops reasonably behind the frontlines, and 114 AATs for vehicular support. When deployed, these vehicles were guided along repulsor tracks to a staging platform. Since the maneuvering equipment on-board was not precise enough to negotiate the cramped confines of the garage zones without causing damage, they required the assistance of the repulsor tracks. At a staging area, the vehicles were rotated into position and grabbed by transport clamps, which brought them aft and lead them down the deployment ramp in the landing craft's foot.\nC-9979 landing craft could also function as carriers, holding Scarab droid starfighters[4] or bombers. One carrier, which worked with Vana Sage in the Eos system, was equipped with a hyperdrive.\nBecause of its heavy cargo, the landing craft had a huge antigravity lifting capacity. The landing craft was manned and operated by B1 battle droids. Landing craft were stored in the hangars of warships where they were assembled, serviced, and repaired. When ready for deployment, they were loaded with ground vehicles. Landing craft were always stored in an unloaded condition to prevent structural stress and so that their vehicles could be serviced and repaired.\n\nTrade Federation Invasion\nLanding crafts, escorted by droid starfighters, approach Naboo.\nDuring the Invasion of Naboo, the Trade Federation deployed large numbers of C-9979 landing craft to transport troops and equipment to the major cities of Naboo. Jedi Knights Qui-Gon Jinn and Obi-Wan Kenobi were able to sneak down to the planet on C-9979s. The craft were deployed in a pattern of groups of three to cut off cities from one another.\nTwo carriers guarded Nod Kartha, but were destroyed when the Lok Revenants attacked the Trihexalon factory there.\nDuring the Clone Wars, when the Trade Federation pledged its forces to the Confederacy of Independent Systems, they were used to transport troops and equipment from orbiting Lucrehulk-class battleships, or other large Separatist ships, down to countless battlefields such as Rhen Var and Thule. 3 of the landing crafts were transported clamped to the bottom of Recusant-class light destroyers.\nDuring the Battle of Coruscant, large numbers of C-9979 landing ships participated in the raid on the capital world of the Republic that saw the kidnapping of Supreme Chancellor Palpatine. There, they unloaded hundreds of millions of battle droids. Some were destroyed by Yoda using the Force.\nThese ships were also deployed on Kashyyyk by invasion force during the Battle of Kashyyyk. There, they were seemingly initially camouflaged with netting.\nThe only known variant of this landing ship was the C-9969 landing craft.",
    "img":"holo_15",
    "visual": "visual_15"
  },
  {
    "name":"Lucrehulk-class battleship",
    "type":"Battleship",
    "manufacturer":"Hoersch-Kessel Drive, Inc.",
    "side":"The Dark Side",
    "alliance":"Trade Federation\nConfederacy of Independant Systems    \nSepartist holdouts",
    "movie":"Star Wars: Episode I The Phantom Menace\nStar Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revange of the Sith",
    "size":"Length:          3,170m\nWidth:            3,009m\nHeight/depth: 1,028.77m",
    "armament":"Pre–Clone Wars refitting:\n43 Quad Turbolaser Batteries \nClone Wars refitting:\n164 Point-defense Quad Laser Batteries \n472 Assault Laser Cannons \n48 Turbolasers \n21 Point-defense Quad Laser Batteries \n48 Assault Laser Cannons \n3 Turbolasers ",
    "crew":"150 to 350",
    "hyperdrive":"Class 2.0 (Backup Class 10)",
    "passengers":"100 000+",
    "maxspeed":"500 km/h in the atmosphere",
    "shortDescr":"The Lucrehulk-class battleship was the primary capital ship of the Trade Federation's Trade Defense Force. Most Lucrehulks were modified from enormous cargo haulers. Upgraded and modified versions were later used by the CIS Navy,the Separatist holdouts, the Alliance to Restore the Republic,the Corporate Sector Authority and the Killik Colony.",
    "longDescr":"At over three kilometers in diameter, the enormous vessel resembled a donut-shape that was missing a section of its circumference and it had a central sphere that contained the ship's bridge and reactor assemblies. The front void of the craft held two mammoth docking bays on either side, which were lined with forward docking claws. These gigantic cargo vessels had been built for many years by the Trade Federation to haul cargo between planets and were an important asset to their enterprise.\nHoused in the stern of the main body were the main reactors, each connected to one of the three main engines, as well as to secondary engines and each other. The central sphere housed its own reactor/power generator assemblies.\nLining the equatorial bands in batteries of three, were quad turbolaser cannons capable of rotating inwards when not in use. Their limited coverage of the hull made the early battleship models vulnerable, and made them rely more on the massive number of starfighters carried to defend the ships against enemy starfighters. This was, however, rectified with later ships whose armor and shields proved too strong for starfighter firepower, the fact becoming quickly apparent at the Battle of Naboo. The pre–Clone Wars models of the battleships did have major defense flaws, as Anakin Skywalker was able to fly his starfighter into the hanger of a Droid Control Ship and destroy the main reactor by accident. The resulting explosion destroyed the battleship and ensured a Naboo victory.\n\nClone Wars–era battleship\nLucrehulk-class battleships that fought in the Clone Wars had less trouble with weak spots, as they were augmented with gun batteries and much stronger shielding. Batteries of long guns and heavy guns complemented the additional quad turbolaser batteries added to the Lucrehulk superstructure when the war erupted.\nEach ship was also now so powerful due to the increased amount of power devoted to offensive and defensive systems that a whole flotilla of Republic Star Destroyers was needed just to bring down a Lucrehulk's shields. The Clone Wars refitted models were true battleships and were among the most powerful ships in the CIS Navy. Due to their firepower and strong shielding and armour, and large starfighter complements, these battleships were often used as command ships and as blockade vessels.\n\nHistory\nOrigins\nWhen the Trade Federation began creating its military, the Executive Board realized the need for large cruisers to transport their weapons across the galaxy, battleships to defend against starfighter attacks, and flagships for controlling their vast legions of battle droids. Reluctant to spend the credits necessary to construct and purchase a fleet of military vessels, the Trade Federation began modifying a portion of its many thousands[16] of Lucrehulk-class freighters into warships.[1] Their early navy had about 10 % of all Lucrehulks converted to battleships and by the battle of Naboo, it was estimated that 35 % of the class had undergone refitting.\nInvasion of Naboo, Lucrehulk blockade\nThe Trade Federation used a substantial fleet of Lucrehulk-class battleships to enforce the invasion of Naboo, led by the flagship Saak'ak. The most important vessel in the Trade Federation's blockade was the Lucrehulk-class Droid Control Ship Vuutun Palaa. When the rest of the blockade dispersed after Naboo was successfully occupied, the Neimoidians left the Droid Control Ship in orbit to coordinate their droid forces. The Control Ship was later destroyed by the young Anakin Skywalker, resulting in the deactivation of the Droid Army.\nAfter the Invasion of Naboo, the Republic ordered the Trade Federation to disband its military forces. The crafty Trade Federation pretended to comply with this command by apparently disassembling most of its battleships, only to transform their centrispheres into detachable core ships capable of carrying supplies as well as increasing the battleship's armaments.\nIn 27 BBY, two of these vessels were used to try to destroy Outbound Flight. The Chiss Commander Thrawn destroyed one of the Lucrehulks, allowing the other to surrender.\nThe Clone Wars\nLucrehulk-class core ships were used during the Battle of Geonosis, where they carried legions of battle droids. In retreat, the Core Ships were found to be able to reattach themselves to the outer ring. These vessels saw continued use during the devastating Clone Wars, transporting military equipment and troops to countless worlds, and engaging Republic fleets in combat.\nDuring the wars, the Lucrehulk-class battleship received a massive upgrade in terms of firepower, with the addition of hundreds of long guns, quad guns, and heavy guns dotting the surface of both the core ship and the surrounding cargo arms. They, along with the other capital ships of the Confederate Navy, also proudly wore the colors and insignia of the Confederacy. A few dozen participated in the attack on Coruscant towards the end of the war.\nLegacy\nDuring the Imperial Period, some militarized Lucrehulks remained in operation, fighting on the side of Separatist holdouts or early Rebel Alliance units. A few battleships kept in Imperial surplus stock were also sold to the Corporate Sector and to wealthy merchants. Other ships were dismantled and sent to garbage dumps like Raxus Prime. Several captured Lucrehulks were pressed into service in the Imperial Navy and used to host flight schools for military fighter pilots. Several Lucrehulks, belonging to an unknown party, were also involved in a skirmish with Rebel forces.\nOne of several Alliance Lucrehulks, the Fortressa served as a starfighter carrier, carrying a complement of hundreds of T-65 X-wing starfighters. In 0 BBY, it participated in an assault on the first Death Star and was destroyed by the battle station's superlaser. In 36 ABY, dozens of Lucrehulk-series freighters were appropriated by forces allied with The Colony and used as carriers for Dartship swarms during the Swarm War.",
    "img":"holo_16",
    "visual": "visual_16"
  },
  {
    "name":"Vulture-class droid starfighter",
    "type":"Droid Starfighter",
    "manufacturer":"Haor Chall Engineering\nBactoid Armor Workshop",
    "side":"The Dark Side",
    "alliance":"Trade Federation\nConfederacy of Independant Systems    \nSepartist holdouts",
    "movie":"Star Wars: Episode I The Phantom Menace\nStar Wars: Episode II Attack of the Clones\nStar Wars: Episode III Revange of the Sith",
    "size":"Length:          3,5m\nHeight/depth: 3,5m",
    "armament":"Trade Federation Version:\n6 Blaster Cannons\n2 Energy Torpedo\nCIS Version:\n6 Blaster Cannons\n4 Buzz Droid Discord Missiles",
    "crew":"Integrated Droid Brain",
    "hyperdrive":"None",
    "passengers":"None",
    "maxspeed":"1200 km/h in the atmosphere",
    "shortDescr":"The Variable Geometry Self-Propelled Battle Droid, Mark I (also known as the Vulture-class droid starfighter or simply as the vulture droid) was a droid starfighter used by the Trade Federation. Later, in much greater numbers, it was utilized by the Confederacy of Independent Systems. It participated heavily in the Clone Wars, at engagements such as the Battle of Kamino and Coruscant.\nLike most of the Trade Federation's armed forces, it carried no living pilot, but rather a droid brain that was linked to a central control computer, often aboard a Lucrehulk-class Droid Control Ship. Each Trade Federationbattleship carried 1,500 such droid starfighters.\nThe Vulture-class was designed by Haor Chall Engineering, which was founded by the fanatical Xi Char, a religious order dedicated to high-precision manufacturing. As a result, it represented classic Xi Charriandesign— an insectoid appearance, multiple weapons emplacements, and a compact body that offered only a small target for enemy fighters.",
    "longDescr":"The starfighter carried six blaster cannons and two energy torpedo launchers, and could reach 1200 kilometers per hour in a planet's atmosphere. When not in flight, the ship could transform into a walking weapons platform, used for ground patrol and troop support. While in this mode, a vulture droid could also latch onto surfaces in zero gravity, allowing it to launch directly from the external hull of a capital ship. The class featured thrust dampers, which if disabled forced starfighters to switch to the walker mode to operate. When docked in a hangar, they would often flex their components as part of self-maintenance. Vultures were also programmed to self-destruct if their link with their host control ship was severed. The ships were controlled via a Central Control Computer on Lucrehulk-class Droid Control Ships.\nA droid starfighter was capable of maneuvers that would kill an organic pilot, but they lacked the resourcefulness and cunning of living pilots, although they were capable of responding much faster. Vulture droids had an unusual fuel system, relying on solid-fuel concentrate slugs that provided propulsion upon ignition. However, they could only function for 35 minutes before having to be refueled. The Trade Federation solved this issue by sending Vulture droids into battle in timed, rotating swarms. Although they could react quicker to new situations than organic pilots, they had trouble responding to friendly units firing on them, a weakness Mace Windu exploited on Haruun Kal and the Battle of Coruscant.\n\nVulture-class schematics.\nVulture droids were also capable of communication with one another, normally with chattering. In addition to this, it is safe to assume Vulture-class droids were capable of communicating with other battle droids, as shown during the Jedi's visit to the Saak'ak, Nute Gunray's flagship. Vulture droid starfighters were usually named by a six-digit designation number, consisting of DFS- and a three-digit alpha-numeric combination, as illustrated by the fighters DFS-1VR and DFS-4CT.\nVulture-class fighters were launched in overwhelming numbers and excelled in both atmospheric and space combat. The vulture droid's weapon systems consisted of four blaster cannons with two per wing. In standard flight format, the drone's wings were collapsed to conceal its blaster cannons. In combat, these wings split up to reveal these blaster cannons. In addition, the droid possessed two energy torpedo launchers that would weaken enemy targets before the starfighter delivered a laser cannon barrage. In walker-mode, the Vulture-class could only use its two torpedo launchers as its cannons were situated on the legs and pointed downwards. During the Clone Wars, vulture droids were modified to carry buzz droid discord missiles, however it's more than likely that they could carry other types of missiles.\nPre-Clone Wars\nThe starfighters are launched from the Trade Federation Droid Control Ship in the Battle of Naboo.\nThe droid starfighter endured rigorous testing before being deployed in the Trade Federation invasion of Naboo in 32 BBY. Droid starfighters saw action during skirmishes with Degan pirates in the Elrood sector and were responsible for defeating the pirate Nym's forces on Lok. The Naboo first encountered these drones when Echo Flight pilots led by Essara Till battled them during an assault on Station TFP-9, not long before the assault on Naboo. The droid starfighter saw action in the Invasion of Naboo, during which they at first provided general air superiority, and later swarms of them fought Naboo N-1 starfighters in the battle above the planet and were ultimately neutralized when Anakin Skywalker disabled the Lucrehulk-class Droid Control Ship. Reports later suggested that the droid starfighters performed sluggishly during the battle due to an overwhelmed Central Control Computer, which also had to direct large numbers of ground troops.\nAfter the battle, droid starfighters commanded by Raith Sienar participated as part of the Trade Federation Defense Fleet alongside Republic forces during the attack on the living world Zonama Sekot. They would also be part of the Trade Federation force sent to destroy Outbound Flight, but were neutralized thanks to the Chiss Commander Thrawn, who exploited their reliance on the droid control signal by jamming its entire spectrum, nullifying the whole force. The captured trader Jorj Car'das later reflected on the incident and mentioned the reports he had read about the starfighters' performance during the Battle of Naboo. They also saw action during the Trade Federation's occupation of the Karthakk system.\nClone Wars\nDuring the Clone Wars, many Vulture-class droids were painted with the blue and white hexagonal insignia of the Confederacy of Independent Systems, although many were seen in the early and middle stages of the war with Trade Federation brown coloring, and were upgraded with buzz droid missile launchers, which they opened their wings to launch. Other manufacturers, chiefly Baktoid Armor Workshop, began production of the Vulture which had originally been built solely by its Xi Char developers.\nVulture droids were fielded by the Confederacy against the Republic in numerous battles and conflicts including the First Battle of Geonosis and the Battle of Coruscant, although the Confederacy also made substantial use of other fighters, such as the Nantex-class territorial defense starfighter. However, they did not pose a serious challenge for Jedi aces such as Anakin Skywalker, as demonstrated in the Battle of Terra Sool.\nIn addition to being launched from capital ships, vulture droids were also deployed from satellite pods to defend areas from potentially hostile approaching vessels.\n\nAt some point during the conflict, the Separatists entered into a trade agreement with the House of Vane from the planet Valahari. The inhabitants of this world were famous for being excellent starship engineers. After the formation of this pact which was formed between Count Dooku and his old friend Harko Vane who believed in neutrality but that the exchange of Valahari technology would benefit his worlds economy. Thus, despite aiding the Separatists, the Valahari claimed to be neutral in the Clone Wars. This alliance led to Valahari fighter components to be added to advanced Vulture droid models giving them a higher level of speed as well as destructive power. These improved droid fighters were later dispatched against the Republic where they destroyed a battlegroup led by Jedi Master Toluz Cheq in the Rial Kroon system. Before he was killed, he managed to upload a transmission as well as scan of the droid fighters to Coruscant thus informing them of this new threat. This led to the Jedi Council in dispatching Obi-Wan Kenobi and Anakin Skywalker to Valahari to negotiate an end to the Confederacy-Valahari alliance.\nWhen Anakin Skywalker and Obi-Wan Kenobi arrived on Iego looking for the antidote to the deadly Blue Shadow Virus,a young Human boy by the name of Jaybo Hood had a reprogrammed army of droids left over from the Separatists which included several vulture droids.\nVulture Droids\nVulture droids in walking mode during the Battle of Coruscant.\nDuring the Battle of Coruscant, Mace Windu was able to ride a vulture by tugging on its cranial wires. General Grievous often used them for suicide attacks designed to sow chaos, by making them perform kamikaze attacks on civilian targets. An advanced model was deployed prior to and during the Clone Wars. Late in the war, Vultures were augmented by droid tri-fighters, which were sturdier but less common.\nGalactic Civil War\nDespite the deactivation of the droid armies, Vulture-class units were apparently being used by some parties by 18 BBY. In addition, several Vulture-class starfighters were modified by Separatist holdouts during the Reconquest of the Rim to accompany organic pilots, of which the 77th Air Wing encountered on Kelrodo-Ai in 17 BBY in the Western Reaches Operation.\nBetween 1 BBY and 0 BBY, several vulture droids were deployed onto Naboo from Lucrehulk-class battleships belonging to an unknown party, resulting in a battle over Naboo's atmosphere by a Rebel Alliance cell on Naboo.\nYears after the Clone Wars, Vulture-class starfighters were utilized by Gizor Dellso in defense of his facility on Mustafar. However, the Galactic Empire uncovered his plan, and the stormtroopers of the 501st Legion stormed the planet, destroying the orbiting defense ships and decimating the facility. Even after this, Vultures would continue to be used by various parties, such as smugglers. Additionally, some groups of independent sentient Vulture droids were spotted in remote parts of some star systems, including the Detritus Satellites or the Scintilla Defenders.\n",
    "img":"holo_17",
    "visual": "visual_17"
  }
]